app/admin/dashboard.rb

    end

    panel "Pengajuan Informasi Baru Masuk" do
      table_for Pengajuaninformasi.where(status: "pengajuan").order(created_at: :desc)do
---
SELECT "pengajuaninformasis".* FROM "pengajuaninformasis" WHERE "pengajuaninformasis"."status" = ? ORDER BY "pengajuaninformasis"."created_at" DESC  [["status", "pengajuan"]]