app/views/homes/index.html.erb

SELECT DATE(created_at) as date, count(*) as count FROM "pengajuaninformasis" GROUP BY DATE(created_at) ORDER BY DATE(created_at)
---
                <div class="accordion-text">
                    <%= line_chart Pengajuaninformasi.grouped_by_day_in_jakarta %>

SELECT COUNT(*) AS "count_all", "pengajuaninformasis"."status" AS "pengajuaninformasis_status" FROM "pengajuaninformasis" GROUP BY "pengajuaninformasis"."status"
---
                        <h3>Status Pengajuan Informasi</h3>
                        <%= pie_chart Pengajuaninformasi.group(:status).count %>