app/controllers/berita_controller.rb

SELECT "artikels".* FROM "artikels" WHERE "artikels"."jenis" = ?  [["jenis", "Berita"]]
---
  def index
    @berita = Artikel.where(jenis: 'Berita')