app/controllers/dokumen_controller.rb

  def increment_access
    @dokumen = Dokuman.find(params[:id])
    @dokumen.increment!(:access_count)
    @dokumen.touch(:updated_at)
---
UPDATE "dokumen" SET "access_count" = COALESCE("access_count", 0) + ? WHERE "dokumen"."id" = ?  [["access_count", 1], ["id", 1]]
UPDATE "dokumen" SET "updated_at" = ? WHERE "dokumen"."id" = ?  [["updated_at", "2024-12-12 09:17:05.770765"], ["id", 1]]