app/controllers/homes_controller.rb

SELECT COUNT(*) FROM "pengajuaninformasis"
---
  def index
    @documenCount = Dokuman.count
    @pengajuaninformasiCount = Pengajuaninformasi.count