app/controllers/kegiatan_controller.rb

SELECT "artikels".* FROM "artikels" WHERE "artikels"."jenis" = ?  [["jenis", "Kegiatan"]]
---
  def index
    @kegiatan = Artikel.where(jenis: 'Kegiatan')