app/controllers/pengajuaninformasis_controller.rb

SELECT "pengajuaninformasis".* FROM "pengajuaninformasis" WHERE "pengajuaninformasis"."noEKtp" = ? LIMIT ? OFFSET ?  [["noEKtp", "1234567890123456"], ["LIMIT", 4], ["OFFSET", 0]]
---
  def new
    @myPengajuan = Pengajuaninformasi.where(noEKtp: current_user.ktp).page(params[:page]).per(4)

INSERT INTO "pengajuaninformasis" ("noEKtp", "namaLenkap", "alamatEmail", "noTelepon", "jenisPermohonan", "alamatLengkap", "pekerjaan", "kebutuhan", "cara_perolehan_informasi", "dokumenIdentitas", "dokumenPermohonanInformasi", "created_at", "updated_at", "tujuan", "user_id", "status") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @pengajuaninformasi = current_user.pengajuaninformasis.new(pengajuaninformasi_params)
    @pengajuaninformasi.status = "pengajuan"
    respond_to do |format|
      if @pengajuaninformasi.save

UPDATE "pengajuaninformasis" SET "alamatEmail" = ?, "noTelepon" = ?, "jenisPermohonan" = ?, "kebutuhan" = ?, "cara_perolehan_informasi" = ?, "updated_at" = ?, "tujuan" = ?, "status" = ? WHERE "pengajuaninformasis"."id" = ?
---
  def update
    respond_to do |format|
      if @pengajuaninformasi.update(pengajuaninformasi_params)

SELECT "pengajuaninformasis".* FROM "pengajuaninformasis" WHERE "pengajuaninformasis"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_pengajuaninformasi
      @pengajuaninformasi = Pengajuaninformasi.find(params[:id])