app/models/pengajuaninformasi.rb

SELECT "pengajuaninformasis".* FROM "pengajuaninformasis"
---
  def self.grouped_by_day_in_jakarta
    all.map { |record| record.updated_at.in_time_zone('Asia/Jakarta').to_date }
       .group_by(&:itself)
       .transform_values(&:count)